[
  "People who labor all their lives but have no purpose to direct every thought and impulse toward are wasting their time - even when hard at work.",
  "Choose not to be harmed - and you won't feel harmed. Don't feel harmed - and you haven't been.",
  "Empty your mind, be formless. Shapeless, like water. If you put water into a cup, it becomes the cup. You put water into a bottle and it becomes the bottle. You put it in a teapot it becomes the teapot. Now, water can flow or it can crash. Be water my friend.",
  "The end of man is action, and not thought, though it be of the noblest.",
  "If you spend too much time thinking about a thing, you'll never get it done.",
  "Knowing is not enough; we must apply. Willing is not enough; we must do.",
  "Rules are not valid because the Senate passed them, or because heroes once played by them, or because God pronounced them through Moses or Muhammad. They are valid only if and when players freely play by them. There are no rules that require us to obey rules. If there were, there would have to be a rule for those rules, and so on.",
  "What the winner of a finite game wins is a title. A title is the acknowledgment of others that one has been the winner of a particular game. I cannot entitle myself. Titles are theatrical, requiring an audience to bestow and respect them.",
  "Infinite players do not rise to meet arms with arms; instead, they make use of laughter, vision, and surprise to engage the state and put its boundaries back into play.",
  "If observers see the poiesis in the work they cease at once being observers. They find themselves in its time, aware that it remains unfinished, aware that their reading of the poetry is itself poetry. Infected then by the genius of the artist they recover their own genius, becoming beginners with nothing but possibility ahead of them.",
  "The great man is he who in the midst of the crowd keeps with perfect sweetness the independence of solitude.",
  "Truly it demands something godlike in him who has cast off the common motives of humanity, and has ventured to trust himself for a taskmaster. If any one imagines that this law is lax, let him keep its commandment one day.",
  "The tranquility that comes when you stop caring what they say. Or think, or do. Only what you do.",
  "Let us enter into the state of war, and wake Thor and Woden, courage and constancy, in our Saxon breasts. This is to be done in our smooth times by speaking the truth. Check this lying hospitality and lying affection. Live no longer to the expectation of these deceived and deceiving people with whom we converse.",
  "The power men possess to annoy men, I give them by a weak curiosity. No man can come near me but through my act.",
  "To accuse others for one's own misfortunes is a sign of want of education; to accuse oneself shows that one's education has begun; to accuse neither oneself nor others shows that one's education is complete.",
  "You can be invincible, if you never enter on a contest where victory is not in your power.",
  "Our opponent is an alien starship packed with atomic bombs. We have a protractor.",
  "Study war and learn from its history. Keep strong, if possible. In any case, keep cool. Have unlimited patience. Never corner an opponent and always assist him to save his face. Put yourself in his shoes  -  so as to see things through his eyes. Avoid self-righteousness like the devil  -  nothing is so self-blinding.",
  "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law.",
  "Our comforting conviction that the world makes sense rests on a secure foundation: our almost unlimited ability to ignore our ignorance.",
  "Our emotional state is largely determined by what we attend to, and we are normally focused on our current activity and immediate environment.",
  "Psychologists have confirmed that most people genuinely believe that they are superior to most others on most desirable traits - they are willing to bet small amounts of money on these beliefs in the laboratory. In the market, of course, beliefs in one's superiority have significant consequences.",
  "The things you think about determine the quality of your mind. Your soul takes on the color of your thoughts.",
  "Loss aversion is a powerful conservative force that favors minimal changes from the status quo in the lives of both institutions and individuals. This conservatism helps keep us stable in our neighborhood, our marriage, and our job; it is the gravitational force that holds our life together near the reference point.",
  "He who would learn to fly one day must first learn to walk and run and climb and dance; one cannot fly into flying.",
  "A good plan, violently executed now, is better than a perfect plan next week.",
  "The highest treason a crab can commit is to make a leap for the rim of the bucket.",
  "The truly free individual is free only to the extent of his own self-mastery.",
  "The amateur ... overidentifies with his avocation, his artistic aspiration. He defines himself by it. He is a musician, a painter, a playwright. Resistance loves this. Resistance knows that the amateur composer will never write his symphony because he is overly invested in its success and overterrified of its failure. The amateur takes it so seriously it paralyzes him.",
  "The professional endures adversity. He lets the birdshit splash down on his slicker, remembering that it comes clean with a heavy-duty hosing. He himself, his creative center, cannot be buried, even beneath a mountain of guano. His core is bulletproof. Nothing can touch it unless he lets it.",
  "To thine own self be true, and it must follow, as the night the day, thou canst not then be false to any man.",
  "Pain and darkness have been our lot since the Fall of Man. But there must be some hope that we can rise to a higher level ... that consciousness can evolve to a plane more benevolent than its counterpoint of a universe hardwired to indifference.",
  "Gaming, like professional sports, has a way of making thirty-year-old men feel decrepit.",
  "The impediment to action advances action. What stands in the way becomes the way.",
  "Until a man is twenty-five, he still thinks, every so often, that under the right circumstances he could be the baddest motherfucker in the world.",
  "Pretenses are shabby things that, like papier-mache houses, must be energetically maintained or they will dissolve.",
  "Your younger nerd takes offense quickly when someone near him begins to utter declarative sentences, because he reads into it an assertion that he, the nerd, does not already know the information being imparted.",
  "The highest form of generalship is to balk the enemy's plans; the next best is to prevent the junction of the enemy's forces; the next in order is to attack the enemy's army in the field; and the worst policy of all is to besiege walled cities.",
  "Let your rapidity be that of the wind, your compactness that of the forest. In raiding and plundering be like fire, is immovability like a mountain. Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.",
  " To secure ourselves against defeat lies in our own hands, but the opportunity of defeating the enemy is provided by the enemy himself.",
  "Do not repeat the tactics which have gained you one victory, but let your methods be regulated by the infinite variety of circumstances.",
  "Water shapes its course according to the nature of the ground over which it flows; the soldier works out his victory in relation to the foe whom he is facing. So in war, the way is to avoid what is strong and to strike at what is weak. Therefore, just as water retains no constant shape, so in warfare there are no constant conditions. He who can modify his tactics in relation to his opponent and thereby succeed in winning, may be called a heaven-born captain.",
  "If the enemy is taking his ease, we can harass him; if well supplied with food, we can starve him out; if quietly encamped, we can force him to move. Appear at points which the enemy must hasten to defend; march swiftly to places where you are not expected.",
  "In battle, there are not more than two methods of attack--the direct and the indirect; yet these two in combination give rise to an endless series of maneuvers. The direct and the indirect lead on to each other in turn. It is like moving in a circle--you never come to an end.",
  "A lot of things are means to some other end. You have to know an awful lot before you can judge other people's actions with real understanding.",
  "The quality of decision is like the well-timed swoop of a falcon which enables it to strike and destroy its victim. Therefore the good fighter will be terrible in his onset, and prompt in his decision.",
  "All warfare is based on deception. Hence, when able to attack, we must seem unable; when using our forces, we must seem inactive; when we are near, we must make the enemy believe we are far away; when far away, we must make him believe we are near.",
  "Numerical weakness comes from having to prepare against possible attacks; numerical strength, from compelling our adversary to make these preparations against us.",
  "Buy the ticket, take the ride ... and if it occasionally gets a little heavier than what you had in mind, well ... maybe chalk it off to forced consciousness expansion.",
  "To him whose elastic and vigorous thought keeps pace with the sun, the day is a perpetual morning. It matters not what the clocks say or the attitudes and labors of men. Morning is when I am awake and there is a dawn in me.",
  "A living dog is better than a dead lion. Shall a man go and hang himself because he belongs to the race of pygmies, and not be the biggest pygmy that he can? Let every one mind his own business, and endeavor to be what he was made.",
  "To be a philosopher is not merely to have subtle thoughts, nor even to found a school, but so to love wisdom as to live according to its dictates, a life of simplicity, independence, magnanimity, and trust. It is to solve some of the problems of life, not only theoretically, but practically.",
  "We all love ourselves more than other people, but care more about their opinion than our own.",
  "The people who spent days and sweated buckets could also have taken an aircraft to the summit if all they'd wanted was to absorb the view. It is the struggle that they crave. The sense of achievement is produced by the route to and from the peak, not by the peak itself. It is just the fold between the pages.",
  "Be like water making its way through cracks. Do not be assertive, but adjust to the object; and you shall find a way around or through it. If nothing within you stays rigid, outward things will disclose themselves.",
  "In great attempts it is glorious even to fail."
]